dinkdeng/RL78_Board_IAR/IAR/Common/inc/RL78G13_Timer.h
#ifndef __RL78G13_TIMER_H_
#define __RL78G13_TIMER_H_
#include "MacroDriver.h"

typedef enum RL78G13_TIMER_CHANNEL
{
    RL78G13_TIMER_CHANNEL_0 = 0,
    RL78G13_TIMER_CHANNEL_1 = 1,
    RL78G13_TIMER_CHANNEL_2 = 2,
    RL78G13_TIMER_CHANNEL_3 = 3,
    RL78G13_TIMER_CHANNEL_4 = 4,
    RL78G13_TIMER_CHANNEL_5 = 5,
    RL78G13_TIMER_CHANNEL_6 = 6,
    RL78G13_TIMER_CHANNEL_7 = 7,
}RL78G13_TIMER_CHANNEL;

/*宏定义*/

/*TPS 选择定时器两个单元的时钟分频系数,一个单元拥有四个时钟*/
#define RL78G13_TIMER_TPS_CLK00_DIV_MASK                                            0X000FU
#define RL78G13_TIMER_TPS_CLK00_DIV_1                                               0X0000U
#define RL78G13_TIMER_TPS_CLK00_DIV_2                                               0X0001U
#define RL78G13_TIMER_TPS_CLK00_DIV_4                                               0X0002U
#define RL78G13_TIMER_TPS_CLK00_DIV_8                                               0X0003U
#define RL78G13_TIMER_TPS_CLK00_DIV_16                                              0X0004U
#define RL78G13_TIMER_TPS_CLK00_DIV_32                                              0X0005U
#define RL78G13_TIMER_TPS_CLK00_DIV_64                                              0X0006U
#define RL78G13_TIMER_TPS_CLK00_DIV_128                                             0X0007U
#define RL78G13_TIMER_TPS_CLK00_DIV_256                                             0X0008U
#define RL78G13_TIMER_TPS_CLK00_DIV_512                                             0X0009U
#define RL78G13_TIMER_TPS_CLK00_DIV_1024                                            0X000AU
#define RL78G13_TIMER_TPS_CLK00_DIV_2048                                            0X000BU
#define RL78G13_TIMER_TPS_CLK00_DIV_4096                                            0X000CU
#define RL78G13_TIMER_TPS_CLK00_DIV_8192                                            0X000DU
#define RL78G13_TIMER_TPS_CLK00_DIV_16384                                           0X000EU
#define RL78G13_TIMER_TPS_CLK00_DIV_32768                                           0X000FU
                                                                                    
#define RL78G13_TIMER_TPS_CLK01_DIV_MASK                                            0X00F0U
#define RL78G13_TIMER_TPS_CLK01_DIV_1                                               0X0000U
#define RL78G13_TIMER_TPS_CLK01_DIV_2                                               0X0010U
#define RL78G13_TIMER_TPS_CLK01_DIV_4                                               0X0020U
#define RL78G13_TIMER_TPS_CLK01_DIV_8                                               0X0030U
#define RL78G13_TIMER_TPS_CLK01_DIV_16                                              0X0040U
#define RL78G13_TIMER_TPS_CLK01_DIV_32                                              0X0050U
#define RL78G13_TIMER_TPS_CLK01_DIV_64                                              0X0060U
#define RL78G13_TIMER_TPS_CLK01_DIV_128                                             0X0070U
#define RL78G13_TIMER_TPS_CLK01_DIV_256                                             0X0080U
#define RL78G13_TIMER_TPS_CLK01_DIV_512                                             0X0090U
#define RL78G13_TIMER_TPS_CLK01_DIV_1024                                            0X00A0U
#define RL78G13_TIMER_TPS_CLK01_DIV_2048                                            0X00B0U
#define RL78G13_TIMER_TPS_CLK01_DIV_4096                                            0X00C0U
#define RL78G13_TIMER_TPS_CLK01_DIV_8192                                            0X00D0U
#define RL78G13_TIMER_TPS_CLK01_DIV_16384                                           0X00E0U
#define RL78G13_TIMER_TPS_CLK01_DIV_32768                                           0X00F0U
                                                                                    
                                                                                    
#define RL78G13_TIMER_TPS_CLK02_DIV_MASK                                            0X0300U
#define RL78G13_TIMER_TPS_CLK02_DIV_2                                               0X0000U
#define RL78G13_TIMER_TPS_CLK02_DIV_4                                               0X0100U
#define RL78G13_TIMER_TPS_CLK02_DIV_16                                              0X0200U
#define RL78G13_TIMER_TPS_CLK02_DIV_64                                              0X0300U
                                                                                    
                                                                                    
#define RL78G13_TIMER_TPS_CLK03_DIV_MASK                                            0X3000U
#define RL78G13_TIMER_TPS_CLK03_DIV_2                                               0X0000U
#define RL78G13_TIMER_TPS_CLK03_DIV_4                                               0X1000U
#define RL78G13_TIMER_TPS_CLK03_DIV_16                                              0X2000U
#define RL78G13_TIMER_TPS_CLK03_DIV_64                                              0X3000U
                                                                                    
                                                                                    
/*TMR 选择定时器指定通道的时钟,运行模式,触发条件*/                                                                             
#define RL78G13_TIMER_TMR_CLOCK_SELECT_MASK                                         0XC000U
#define RL78G13_TIMER_TMR_CLOCK_SELECT_CLK0                                         0X0000U
#define RL78G13_TIMER_TMR_CLOCK_SELECT_CLK2                                         0X4000U
#define RL78G13_TIMER_TMR_CLOCK_SELECT_CLK1                                         0X8000U
#define RL78G13_TIMER_TMR_CLOCK_SELECT_CLK3                                         0XC000U
                                                                                    
#define RL78G13_TIMER_TMR_CCS_FTCLK_SELECT_MASK                                     0X1000U
#define RL78G13_TIMER_TMR_CCS_FTCLK_SELECT_MCK                                      0X0000U
#define RL78G13_TIMER_TMR_CCS_FTCLK_SELECT_INPUT                                    0X1000U
                                                                                    
#define RL78G13_TIMER_TMR_STS_TRIG_SRC_SELECT_MASK                                  0X0700U
#define RL78G13_TIMER_TMR_STS_TRIG_SRC_SELECT_SOFT                                  0X0000U
#define RL78G13_TIMER_TMR_STS_TRIG_SRC_SELECT_ALL_EDGE                              0X0100U
#define RL78G13_TIMER_TMR_STS_TRIG_SRC_SELECT_2EDGE                                 0X0200U
#define RL78G13_TIMER_TMR_STS_TRIG_SRC_SELECT_INT_MAIN                              0X0400U
                                                                                    
#define RL78G13_TIMER_TMR_CIS_TRIG_EDGE_SELECT_MASK                                 0X00C0U
#define RL78G13_TIMER_TMR_CIS_TRIG_EDGE_SELECT_FALLING                              0X0000U
#define RL78G13_TIMER_TMR_CIS_TRIG_EDGE_SELECT_RISEING                              0X0040U
#define RL78G13_TIMER_TMR_CIS_TRIG_EDGE_SELECT_ALL_BY_LOW                           0X0080U
#define RL78G13_TIMER_TMR_CIS_TRIG_EDGE_SELECT_ALL_BY_HIGH                          0X00C0U
                                                                                    
#define RL78G13_TIMER_TMR_CHANNEL_MODE_SELECT_MASK                                  0X000EU
#define RL78G13_TIMER_TMR_CHANNEL_MODE_SELECT_COUNT                                 0X0000U
#define RL78G13_TIMER_TMR_CHANNEL_MODE_SELECT_CAPTURE                               0X0004U
#define RL78G13_TIMER_TMR_CHANNEL_MODE_SELECT_EVENT_COUNT                           0X0006U
#define RL78G13_TIMER_TMR_CHANNEL_MODE_SELECT_ONLY_COUNT                            0X0008U
#define RL78G13_TIMER_TMR_CHANNEL_MODE_SELECT_CAPTURE_ONLY_COUNT                    0X000CU
                                                                                    
#define RL78G13_TIMER_TMR_START_INT_ENABLE_MASK                                     0X0001U
#define RL78G13_TIMER_TMR_START_INT_ENABLE                                          0X0001U
#define RL78G13_TIMER_TMR_START_INT_DISABLE                                         0X0000U
                                                                                    
#define RL78G13_TIMER_TMR_MASTER_SELECT_MASK                                        0X0800U
#define RL78G13_TIMER_TMR_MASTER_SELECT_SINGLE                                      0X0000U
#define RL78G13_TIMER_TMR_MASTER_SELECT_LINK                                        0X0800U
                                                                                    
