dinkdeng/RL78_Board_IAR/IAR/Common/inc/RL78G13_Timer.h
#define RL78G13_TIMER_TMR_SPLIT_SELECT_MASK                                         0X0800U
#define RL78G13_TIMER_TMR_SPLIT_SELECT_16BIT                                        0X0000U
#define RL78G13_TIMER_TMR_SPLIT_SELECT_8BIT                                         0X0800U
                                                                                    
/*TSR 指定通道是否发出溢出事件*/                                                                             
#define RL78G13_TIMER_TSR_OVERFLOW_MASK                                             0X0001U
#define RL78G13_TIMER_TSR_OVERFLOW_ON                                               0X0001U
#define RL78G13_TIMER_TSR_OVERFLOW_OFF                                              0X0000U
                                                                                    
/*TE 当前通道处于运行状态还是停滞状态*/                                                                              
#define RL78G13_TIMER_TE_CHANNEL0_STATUS_MASK                                       0X0001U
#define RL78G13_TIMER_TE_CHANNEL0_STATUS_ENABLE                                     0X0001U
#define RL78G13_TIMER_TE_CHANNEL0_STATUS_DISABLE                                    0X0000U
                                                                                    
#define RL78G13_TIMER_TE_CHANNEL1_STATUS_MASK                                       0X0002U
#define RL78G13_TIMER_TE_CHANNEL1_STATUS_ENABLE                                     0X0002U
#define RL78G13_TIMER_TE_CHANNEL1_STATUS_DISABLE                                    0X0000U
                                                                                    
#define RL78G13_TIMER_TE_CHANNEL2_STATUS_MASK                                       0X0004U
#define RL78G13_TIMER_TE_CHANNEL2_STATUS_ENABLE                                     0X0004U
#define RL78G13_TIMER_TE_CHANNEL2_STATUS_DISABLE                                    0X0000U
                                                                                    
#define RL78G13_TIMER_TE_CHANNEL3_STATUS_MASK                                       0X0008U
#define RL78G13_TIMER_TE_CHANNEL3_STATUS_ENABLE                                     0X0008U
#define RL78G13_TIMER_TE_CHANNEL3_STATUS_DISABLE                                    0X0000U
                                                                                    
#define RL78G13_TIMER_TE_CHANNEL4_STATUS_MASK                                       0X0010U
#define RL78G13_TIMER_TE_CHANNEL4_STATUS_ENABLE                                     0X0010U
#define RL78G13_TIMER_TE_CHANNEL4_STATUS_DISABLE                                    0X0000U
                                                                                    
#define RL78G13_TIMER_TE_CHANNEL5_STATUS_MASK                                       0X0020U
#define RL78G13_TIMER_TE_CHANNEL5_STATUS_ENABLE                                     0X0020U
#define RL78G13_TIMER_TE_CHANNEL5_STATUS_DISABLE                                    0X0000U
                                                                                    
#define RL78G13_TIMER_TE_CHANNEL6_STATUS_MASK                                       0X0040U
#define RL78G13_TIMER_TE_CHANNEL6_STATUS_ENABLE                                     0X0040U
#define RL78G13_TIMER_TE_CHANNEL6_STATUS_DISABLE                                    0X0000U
                                                                                    
#define RL78G13_TIMER_TE_CHANNEL7_STATUS_MASK                                       0X0080U
#define RL78G13_TIMER_TE_CHANNEL7_STATUS_ENABLE                                     0X0080U
#define RL78G13_TIMER_TE_CHANNEL7_STATUS_DISABLE                                    0X0000U
                                                                                    
#define RL78G13_TIMER_TE_CHANNEL_H1_STATUS_MASK                                     0X0200U
#define RL78G13_TIMER_TE_CHANNEL_H1_STATUS_ENABLE                                   0X0200U
#define RL78G13_TIMER_TE_CHANNEL_H1_STATUS_DISABLE                                  0X0000U
                                                                                    
#define RL78G13_TIMER_TE_CHANNEL_H3_STATUS_MASK                                     0X0800U
#define RL78G13_TIMER_TE_CHANNEL_H3_STATUS_ENABLE                                   0X0800U
#define RL78G13_TIMER_TE_CHANNEL_H3_STATUS_DISABLE                                  0X0000U
                                                                                    
                                                                                    
/*TS 指定通道启动运行*/                                                                              
#define RL78G13_TIMER_TS_CHANNEL0_START_ON_MASK                                     0X0001U
#define RL78G13_TIMER_TS_CHANNEL0_START_ON                                          0X0001U
#define RL78G13_TIMER_TS_CHANNEL0_START_OFF                                         0X0000U

#define RL78G13_TIMER_TS_CHANNEL1_START_ON_MASK                                     0X0002U
#define RL78G13_TIMER_TS_CHANNEL1_START_ON                                          0X0002U
#define RL78G13_TIMER_TS_CHANNEL1_START_OFF                                         0X0000U

#define RL78G13_TIMER_TS_CHANNEL2_START_ON_MASK                                     0X0004U
#define RL78G13_TIMER_TS_CHANNEL2_START_ON                                          0X0004U
#define RL78G13_TIMER_TS_CHANNEL2_START_OFF                                         0X0000U

#define RL78G13_TIMER_TS_CHANNEL3_START_ON_MASK                                     0X0008U
#define RL78G13_TIMER_TS_CHANNEL3_START_ON                                          0X0008U
#define RL78G13_TIMER_TS_CHANNEL3_START_OFF                                         0X0000U

#define RL78G13_TIMER_TS_CHANNEL4_START_ON_MASK                                     0X0010U
#define RL78G13_TIMER_TS_CHANNEL4_START_ON                                          0X0010U
#define RL78G13_TIMER_TS_CHANNEL4_START_OFF                                         0X0000U

#define RL78G13_TIMER_TS_CHANNEL5_START_ON_MASK                                     0X0020U
#define RL78G13_TIMER_TS_CHANNEL5_START_ON                                          0X0020U
#define RL78G13_TIMER_TS_CHANNEL5_START_OFF                                         0X0000U

#define RL78G13_TIMER_TS_CHANNEL6_START_ON_MASK                                     0X0040U
#define RL78G13_TIMER_TS_CHANNEL6_START_ON                                          0X0040U
#define RL78G13_TIMER_TS_CHANNEL6_START_OFF                                         0X0000U

#define RL78G13_TIMER_TS_CHANNEL7_START_ON_MASK                                     0X0080U
#define RL78G13_TIMER_TS_CHANNEL7_START_ON                                          0X0080U
#define RL78G13_TIMER_TS_CHANNEL7_START_OFF                                         0X0000U

