dinkdeng/RL78_Board_IAR/IAR/Common/inc/RL78G13_Timer.h
#define RL78G13_TIMER_TS_CHANNEL_H1_START_ON_MASK                                   0X0200U
#define RL78G13_TIMER_TS_CHANNEL_H1_START_ON                                        0X0200U
#define RL78G13_TIMER_TS_CHANNEL_H1_START_OFF                                       0X0000U

#define RL78G13_TIMER_TS_CHANNEL_H3_START_ON_MASK                                   0X0800U
#define RL78G13_TIMER_TS_CHANNEL_H3_START_ON                                        0X0800U
#define RL78G13_TIMER_TS_CHANNEL_H3_START_OFF                                       0X0000U
                                                                                    
                                                                                    
                                                                                    
/*TT 指定通道运行停止*/                                                                              
#define RL78G13_TIMER_TT_CHANNEL0_STOP_ON_MASK                                      0X0001U
#define RL78G13_TIMER_TT_CHANNEL0_STOP_ON                                           0X0001U
#define RL78G13_TIMER_TT_CHANNEL0_STOP_OFF                                          0X0000U

#define RL78G13_TIMER_TT_CHANNEL1_STOP_ON_MASK                                      0X0002U
#define RL78G13_TIMER_TT_CHANNEL1_STOP_ON                                           0X0002U
#define RL78G13_TIMER_TT_CHANNEL1_STOP_OFF                                          0X0000U

#define RL78G13_TIMER_TT_CHANNEL2_STOP_ON_MASK                                      0X0004U
#define RL78G13_TIMER_TT_CHANNEL2_STOP_ON                                           0X0004U
#define RL78G13_TIMER_TT_CHANNEL2_STOP_OFF                                          0X0000U

#define RL78G13_TIMER_TT_CHANNEL3_STOP_ON_MASK                                      0X0008U
#define RL78G13_TIMER_TT_CHANNEL3_STOP_ON                                           0X0008U
#define RL78G13_TIMER_TT_CHANNEL3_STOP_OFF                                          0X0000U

#define RL78G13_TIMER_TT_CHANNEL4_STOP_ON_MASK                                      0X0010U
#define RL78G13_TIMER_TT_CHANNEL4_STOP_ON                                           0X0010U
#define RL78G13_TIMER_TT_CHANNEL4_STOP_OFF                                          0X0000U

#define RL78G13_TIMER_TT_CHANNEL5_STOP_ON_MASK                                      0X0020U
#define RL78G13_TIMER_TT_CHANNEL5_STOP_ON                                           0X0020U
#define RL78G13_TIMER_TT_CHANNEL5_STOP_OFF                                          0X0000U

#define RL78G13_TIMER_TT_CHANNEL6_STOP_ON_MASK                                      0X0040U
#define RL78G13_TIMER_TT_CHANNEL6_STOP_ON                                           0X0040U
#define RL78G13_TIMER_TT_CHANNEL6_STOP_OFF                                          0X0000U

#define RL78G13_TIMER_TT_CHANNEL7_STOP_ON_MASK                                      0X0080U
#define RL78G13_TIMER_TT_CHANNEL7_STOP_ON                                           0X0080U
#define RL78G13_TIMER_TT_CHANNEL7_STOP_OFF                                          0X0000U

#define RL78G13_TIMER_TT_CHANNEL_H1_STOP_ON_MASK                                    0X0200U
#define RL78G13_TIMER_TT_CHANNEL_H1_STOP_ON                                         0X0200U
#define RL78G13_TIMER_TT_CHANNEL_H1_STOP_OFF                                        0X0000U

#define RL78G13_TIMER_TT_CHANNEL_H3_STOP_ON_MASK                                    0X0800U
#define RL78G13_TIMER_TT_CHANNEL_H3_STOP_ON                                         0X0800U
#define RL78G13_TIMER_TT_CHANNEL_H3_STOP_OFF                                        0X0000U
                                                                                    
/*TIS 通道5的定时器输入信号*/                                                                             
#define RL78G13_TIMER_TIS_CHANNEL5_INPUT_PIN_SELECT_MASK                            0X07U
#define RL78G13_TIMER_TIS_CHANNEL5_INPUT_PIN_SELECT_TIO5                            0X00U
#define RL78G13_TIMER_TIS_CHANNEL5_INPUT_PIN_SELECT_FIL                             0X04U
#define RL78G13_TIMER_TIS_CHANNEL5_INPUT_PIN_SELECT_FSUB                            0X05U
                                                                                    
/*TOE 禁止或者使能定时器的输出*/                                                                             
#define RL78G13_TIMER_TOE_CHANNEL_0_OUTPUT_SET_MASK                                 0X0001U
#define RL78G13_TIMER_TOE_CHANNEL_0_OUTPUT_SET_DISABLE                              0X0000U
#define RL78G13_TIMER_TOE_CHANNEL_0_OUTPUT_SET_ENABLE                               0X0001U
                                                                                    
#define RL78G13_TIMER_TOE_CHANNEL_1_OUTPUT_SET_MASK                                 0X0002U
#define RL78G13_TIMER_TOE_CHANNEL_1_OUTPUT_SET_DISABLE                              0X0000U
#define RL78G13_TIMER_TOE_CHANNEL_1_OUTPUT_SET_ENABLE                               0X0002U
                                                                                    
#define RL78G13_TIMER_TOE_CHANNEL_2_OUTPUT_SET_MASK                                 0X0004U
#define RL78G13_TIMER_TOE_CHANNEL_2_OUTPUT_SET_DISABLE                              0X0000U
#define RL78G13_TIMER_TOE_CHANNEL_2_OUTPUT_SET_ENABLE                               0X0004U
                                                                                    
#define RL78G13_TIMER_TOE_CHANNEL_3_OUTPUT_SET_MASK                                 0X0008U
#define RL78G13_TIMER_TOE_CHANNEL_3_OUTPUT_SET_DISABLE                              0X0000U
#define RL78G13_TIMER_TOE_CHANNEL_3_OUTPUT_SET_ENABLE                               0X0008U
                                                                                    
#define RL78G13_TIMER_TOE_CHANNEL_4_OUTPUT_SET_MASK                                 0X0010U
#define RL78G13_TIMER_TOE_CHANNEL_4_OUTPUT_SET_DISABLE                              0X0000U
#define RL78G13_TIMER_TOE_CHANNEL_4_OUTPUT_SET_ENABLE                               0X0010U
                                                                                    
#define RL78G13_TIMER_TOE_CHANNEL_5_OUTPUT_SET_MASK                                 0X0020U
#define RL78G13_TIMER_TOE_CHANNEL_5_OUTPUT_SET_DISABLE                              0X0000U
#define RL78G13_TIMER_TOE_CHANNEL_5_OUTPUT_SET_ENABLE                               0X0020U
                                                                                    
#define RL78G13_TIMER_TOE_CHANNEL_6_OUTPUT_SET_MASK                                 0X0040U
#define RL78G13_TIMER_TOE_CHANNEL_6_OUTPUT_SET_DISABLE                              0X0000U
#define RL78G13_TIMER_TOE_CHANNEL_6_OUTPUT_SET_ENABLE                               0X0040U
                                                                                    
#define RL78G13_TIMER_TOE_CHANNEL_7_OUTPUT_SET_MASK                                 0X0080U
#define RL78G13_TIMER_TOE_CHANNEL_7_OUTPUT_SET_DISABLE                              0X0000U
#define RL78G13_TIMER_TOE_CHANNEL_7_OUTPUT_SET_ENABLE                               0X0080U
                                                                                    
                                                                                    
/*TO 定时器输出寄存器*/                                                                              
#define RL78G13_TIMER_TO_CHANNEL_0_OUTPUT_VALUE_MASK                                0X0001U
#define RL78G13_TIMER_TO_CHANNEL_0_OUTPUT_VALUE_1                                   0X0001U
#define RL78G13_TIMER_TO_CHANNEL_0_OUTPUT_VALUE_0                                   0X0000U
                                                                                    
