dinkdeng/RL78_Board_IAR/IAR/Common/inc/RL78G13_Timer.h
#define RL78G13_TIMER_TO_CHANNEL_1_OUTPUT_VALUE_MASK                                0X0002U
#define RL78G13_TIMER_TO_CHANNEL_1_OUTPUT_VALUE_1                                   0X0002U
#define RL78G13_TIMER_TO_CHANNEL_1_OUTPUT_VALUE_0                                   0X0000U
                                                                                    
#define RL78G13_TIMER_TO_CHANNEL_2_OUTPUT_VALUE_MASK                                0X0004U
#define RL78G13_TIMER_TO_CHANNEL_2_OUTPUT_VALUE_1                                   0X0004U
#define RL78G13_TIMER_TO_CHANNEL_2_OUTPUT_VALUE_0                                   0X0000U
                                                                                    
#define RL78G13_TIMER_TO_CHANNEL_3_OUTPUT_VALUE_MASK                                0X0008U
#define RL78G13_TIMER_TO_CHANNEL_3_OUTPUT_VALUE_1                                   0X0008U
#define RL78G13_TIMER_TO_CHANNEL_3_OUTPUT_VALUE_0                                   0X0000U
                                                                                    
#define RL78G13_TIMER_TO_CHANNEL_4_OUTPUT_VALUE_MASK                                0X0010U
#define RL78G13_TIMER_TO_CHANNEL_4_OUTPUT_VALUE_1                                   0X0010U
#define RL78G13_TIMER_TO_CHANNEL_4_OUTPUT_VALUE_0                                   0X0000U
                                                                                    
#define RL78G13_TIMER_TO_CHANNEL_5_OUTPUT_VALUE_MASK                                0X0020U
#define RL78G13_TIMER_TO_CHANNEL_5_OUTPUT_VALUE_1                                   0X0020U
#define RL78G13_TIMER_TO_CHANNEL_5_OUTPUT_VALUE_0                                   0X0000U
                                                                                    
#define RL78G13_TIMER_TO_CHANNEL_6_OUTPUT_VALUE_MASK                                0X0040U
#define RL78G13_TIMER_TO_CHANNEL_6_OUTPUT_VALUE_1                                   0X0040U
#define RL78G13_TIMER_TO_CHANNEL_6_OUTPUT_VALUE_0                                   0X0000U
                                                                                    
#define RL78G13_TIMER_TO_CHANNEL_7_OUTPUT_VALUE_MASK                                0X0080U
#define RL78G13_TIMER_TO_CHANNEL_7_OUTPUT_VALUE_1                                   0X0080U
#define RL78G13_TIMER_TO_CHANNEL_7_OUTPUT_VALUE_0                                   0X0000U
                                                                                    
/*TOL 输出电平逻辑寄存器,正向为0 反向为1*/                                                                             
#define RL78G13_TIMER_TOL_CHANNEL_1_OUTPUT_REVESER_MASK                             0X0002U
#define RL78G13_TIMER_TOL_CHANNEL_1_OUTPUT_REVESER_ON                               0X0002U
#define RL78G13_TIMER_TOL_CHANNEL_1_OUTPUT_REVESER_OFF                              0X0000U

#define RL78G13_TIMER_TOL_CHANNEL_2_OUTPUT_REVESER_MASK                             0X0004U
#define RL78G13_TIMER_TOL_CHANNEL_2_OUTPUT_REVESER_ON                               0X0004U
#define RL78G13_TIMER_TOL_CHANNEL_2_OUTPUT_REVESER_OFF                              0X0000U

#define RL78G13_TIMER_TOL_CHANNEL_3_OUTPUT_REVESER_MASK                             0X0008U
#define RL78G13_TIMER_TOL_CHANNEL_3_OUTPUT_REVESER_ON                               0X0008U
#define RL78G13_TIMER_TOL_CHANNEL_3_OUTPUT_REVESER_OFF                              0X0000U

#define RL78G13_TIMER_TOL_CHANNEL_4_OUTPUT_REVESER_MASK                             0X0010U
#define RL78G13_TIMER_TOL_CHANNEL_4_OUTPUT_REVESER_ON                               0X0010U
#define RL78G13_TIMER_TOL_CHANNEL_4_OUTPUT_REVESER_OFF                              0X0000U

#define RL78G13_TIMER_TOL_CHANNEL_5_OUTPUT_REVESER_MASK                             0X0020U
#define RL78G13_TIMER_TOL_CHANNEL_5_OUTPUT_REVESER_ON                               0X0020U
#define RL78G13_TIMER_TOL_CHANNEL_5_OUTPUT_REVESER_OFF                              0X0000U

#define RL78G13_TIMER_TOL_CHANNEL_6_OUTPUT_REVESER_MASK                             0X0040U
#define RL78G13_TIMER_TOL_CHANNEL_6_OUTPUT_REVESER_ON                               0X0040U
#define RL78G13_TIMER_TOL_CHANNEL_6_OUTPUT_REVESER_OFF                              0X0000U

#define RL78G13_TIMER_TOL_CHANNEL_7_OUTPUT_REVESER_MASK                             0X0080U
#define RL78G13_TIMER_TOL_CHANNEL_7_OUTPUT_REVESER_ON                               0X0080U
#define RL78G13_TIMER_TOL_CHANNEL_7_OUTPUT_REVESER_OFF                              0X0000U
                                                                                   
                                                                                    
/*TOM 通道输出模式寄存器,中断输出还是从属输出*/                                                                             
#define RL78G13_TIMER_TOM_CHANNEL_1_OUTPUT_MODE_MASK                                0X0002U
#define RL78G13_TIMER_TOM_CHANNEL_1_OUTPUT_MODE_MAIN                                0X0000U
#define RL78G13_TIMER_TOM_CHANNEL_1_OUTPUT_MODE_SUB                                 0X0002U
                                             

#define RL78G13_TIMER_TOM_CHANNEL_2_OUTPUT_MODE_MASK                                0X0004U
#define RL78G13_TIMER_TOM_CHANNEL_2_OUTPUT_MODE_MAIN                                0X0000U
#define RL78G13_TIMER_TOM_CHANNEL_2_OUTPUT_MODE_SUB                                 0X0004U
                                                

#define RL78G13_TIMER_TOM_CHANNEL_3_OUTPUT_MODE_MASK                                0X0008U
#define RL78G13_TIMER_TOM_CHANNEL_3_OUTPUT_MODE_MAIN                                0X0000U
#define RL78G13_TIMER_TOM_CHANNEL_3_OUTPUT_MODE_SUB                                 0X0008U
                                              

#define RL78G13_TIMER_TOM_CHANNEL_4_OUTPUT_MODE_MASK                                0X0010U
#define RL78G13_TIMER_TOM_CHANNEL_4_OUTPUT_MODE_MAIN                                0X0000U
#define RL78G13_TIMER_TOM_CHANNEL_4_OUTPUT_MODE_SUB                                 0X0010U
                                                

#define RL78G13_TIMER_TOM_CHANNEL_5_OUTPUT_MODE_MASK                                0X0020U
#define RL78G13_TIMER_TOM_CHANNEL_5_OUTPUT_MODE_MAIN                                0X0000U
#define RL78G13_TIMER_TOM_CHANNEL_5_OUTPUT_MODE_SUB                                 0X0020U
                                                     

