dinkdeng/RL78_Board_IAR/IAR/Common/inc/RL78G13_Timer.h
#define RL78G13_TIMER_TOM_CHANNEL_6_OUTPUT_MODE_MASK                                0X0040U
#define RL78G13_TIMER_TOM_CHANNEL_6_OUTPUT_MODE_MAIN                                0X0000U
#define RL78G13_TIMER_TOM_CHANNEL_6_OUTPUT_MODE_SUB                                 0X0040U
                                                 

#define RL78G13_TIMER_TOM_CHANNEL_7_OUTPUT_MODE_MASK                                0X0080U
#define RL78G13_TIMER_TOM_CHANNEL_7_OUTPUT_MODE_MAIN                                0X0000U
#define RL78G13_TIMER_TOM_CHANNEL_7_OUTPUT_MODE_SUB                                 0X0080U
                                                   
/*NFEN滤波*/
#define RL78G13_TIMER_NFEN2_CHANNEL_0_NOISE_FILTER_MODE_MASK                        0X01U
#define RL78G13_TIMER_NFEN2_CHANNEL_0_NOISE_FILTER_MODE_ENABLE                      0X01U
#define RL78G13_TIMER_NFEN2_CHANNEL_0_NOISE_FILTER_MODE_DISABLE                     0X00U
                                                                                   
#define RL78G13_TIMER_NFEN2_CHANNEL_1_NOISE_FILTER_MODE_MASK                        0X02U
#define RL78G13_TIMER_NFEN2_CHANNEL_1_NOISE_FILTER_MODE_ENABLE                      0X02U
#define RL78G13_TIMER_NFEN2_CHANNEL_1_NOISE_FILTER_MODE_DISABLE                     0X00U
                                                                   
#define RL78G13_TIMER_NFEN2_CHANNEL_2_NOISE_FILTER_MODE_MASK                        0X04U
#define RL78G13_TIMER_NFEN2_CHANNEL_2_NOISE_FILTER_MODE_ENABLE                      0X04U
#define RL78G13_TIMER_NFEN2_CHANNEL_2_NOISE_FILTER_MODE_DISABLE                     0X00U
                                                                    
#define RL78G13_TIMER_NFEN2_CHANNEL_3_NOISE_FILTER_MODE_MASK                        0X08U
#define RL78G13_TIMER_NFEN2_CHANNEL_3_NOISE_FILTER_MODE_ENABLE                      0X08U
#define RL78G13_TIMER_NFEN2_CHANNEL_3_NOISE_FILTER_MODE_DISABLE                     0X00U
                                                                                    
#define RL78G13_TIMER_NFEN2_CHANNEL_4_NOISE_FILTER_MODE_MASK                        0X10U
#define RL78G13_TIMER_NFEN2_CHANNEL_4_NOISE_FILTER_MODE_ENABLE                      0X10U
#define RL78G13_TIMER_NFEN2_CHANNEL_4_NOISE_FILTER_MODE_DISABLE                     0X00U
                                                                                    
#define RL78G13_TIMER_NFEN2_CHANNEL_5_NOISE_FILTER_MODE_MASK                        0X20U
#define RL78G13_TIMER_NFEN2_CHANNEL_5_NOISE_FILTER_MODE_ENABLE                      0X20U
#define RL78G13_TIMER_NFEN2_CHANNEL_5_NOISE_FILTER_MODE_DISABLE                     0X00U
                                                                                    
#define RL78G13_TIMER_NFEN2_CHANNEL_6_NOISE_FILTER_MODE_MASK                        0X40U
#define RL78G13_TIMER_NFEN2_CHANNEL_6_NOISE_FILTER_MODE_ENABLE                      0X40U
#define RL78G13_TIMER_NFEN2_CHANNEL_6_NOISE_FILTER_MODE_DISABLE                     0X00U
                                                                                    
#define RL78G13_TIMER_NFEN2_CHANNEL_7_NOISE_FILTER_MODE_MASK                        0X80U
#define RL78G13_TIMER_NFEN2_CHANNEL_7_NOISE_FILTER_MODE_ENABLE                      0X80U
#define RL78G13_TIMER_NFEN2_CHANNEL_7_NOISE_FILTER_MODE_DISABLE                     0X00U



/*函数API接口定义*/

void RL78G13_Timer_TPS_Write_All(uint16_t flck0, uint16_t flck1,
    uint16_t flck2, uint16_t flck3);
void RL78G13_Timer_TPS_Write_One(uint16_t mask, uint16_t value);
uint16_t RL78G13_Timer_TPS_ReadAll(void);
uint16_t RL78G13_Timer_TPS_ReadOne(uint16_t mask);

void RL78G13_Timer_TMR_Write_All(RL78G13_TIMER_CHANNEL ch, uint16_t clkSelect,
    uint16_t tclkSelect, uint16_t masterSplitSelect, uint16_t trigStartMode,
    uint16_t edgeSelect, uint16_t channelModeSelect, uint16_t startIntSet);
void RL78G13_Timer_TMR_Write_One(RL78G13_TIMER_CHANNEL ch,
    uint16_t mask, uint16_t value);
uint16_t RL78G13_Timer_TMR_ReadAll(RL78G13_TIMER_CHANNEL ch);
uint16_t RL78G13_Timer_TMR_ReadOne(RL78G13_TIMER_CHANNEL ch,
    uint16_t mask);


uint16_t RL78G13_Timer_TSR_ReadAll(RL78G13_TIMER_CHANNEL ch);
uint16_t RL78G13_Timer_TSR_ReadOne(RL78G13_TIMER_CHANNEL ch,
    uint16_t mask);

uint16_t RL78G13_Timer_TE_ReadAll(void);
uint16_t RL78G13_Timer_TE_ReadOne(uint16_t mask);


void RL78G13_Timer_TS_Write_All(uint16_t channel0Start, uint16_t channel1Start,
    uint16_t channel2Start, uint16_t channel3Start, uint16_t channel4Start,
    uint16_t channel5Start, uint16_t channel6Start, uint16_t channel7Start,
    uint16_t channelh1Start, uint16_t channelh3Start);
void RL78G13_Timer_TS_Write_One(uint16_t mask, uint16_t value);
uint16_t RL78G13_Timer_TS_ReadAll(void);
uint16_t RL78G13_Timer_TS_ReadOne(uint16_t mask);

void RL78G13_Timer_TT_Write_All(uint16_t channel0Stop, uint16_t channel1Stop,
    uint16_t channel2Stop, uint16_t channel3Stop, uint16_t channel4Stop,
    uint16_t channel5Stop, uint16_t channel6Stop, uint16_t channel7Stop,
    uint16_t channelh1Stop, uint16_t channelh3Stop);
void RL78G13_Timer_TT_Write_One(uint16_t mask, uint16_t value);
uint16_t RL78G13_Timer_TT_ReadAll(void);
uint16_t RL78G13_Timer_TT_ReadOne(uint16_t mask);

void RL78G13_Timer_TIS_Write_All(uint8_t ch5InputSelect);
void RL78G13_Timer_TIS_Write_One(uint8_t mask, uint8_t value);
uint8_t RL78G13_Timer_TIS_ReadAll(void);
uint8_t RL78G13_Timer_TIS_ReadOne(uint8_t mask);

void RL78G13_Timer_TOE_Write_All(uint16_t channel0OutputEnable, uint16_t channel1OutputEnable,
    uint16_t channel2OutputEnable, uint16_t channel3OutputEnable, uint16_t channel4OutputEnable,
    uint16_t channel5OutputEnable, uint16_t channel6OutputEnable, uint16_t channel7OutputEnable);
void RL78G13_Timer_TOE_Write_One(uint16_t mask, uint16_t value);
uint16_t RL78G13_Timer_TOE_ReadAll(void);
uint16_t RL78G13_Timer_TOE_ReadOne(uint16_t mask);


void RL78G13_Timer_TO_Write_All(uint16_t channel0OutputValue, uint16_t channel1OutputValue,
    uint16_t channel2OutputValue, uint16_t channel3OutputValue, uint16_t channel4OutputValue,
    uint16_t channel5OutputValue, uint16_t channel6OutputValue, uint16_t channel7OutputValue);
void RL78G13_Timer_TO_Write_One(uint16_t mask, uint16_t value);
uint16_t RL78G13_Timer_TO_ReadAll(void);
uint16_t RL78G13_Timer_TO_ReadOne(uint16_t mask);

void RL78G13_Timer_TOL_Write_All(uint16_t channel1Resever, uint16_t channel2Resever,
    uint16_t channel3Resever, uint16_t channel4Resever, uint16_t channel5Resever,
    uint16_t channel6Resever, uint16_t channel7Resever);
void RL78G13_Timer_TOL_Write_One(uint16_t mask, uint16_t value);
uint16_t RL78G13_Timer_TOL_ReadAll(void);
uint16_t RL78G13_Timer_TOL_ReadOne(uint16_t mask);

void RL78G13_Timer_TOM_Write_All(uint16_t channel1OutPutMode, uint16_t channel2OutPutMode,
    uint16_t channel3OutPutMode, uint16_t channel4OutPutMode, uint16_t channel5OutPutMode,
    uint16_t channel6OutPutMode, uint16_t channel7OutPutMode);
void RL78G13_Timer_TOM_Write_One(uint16_t mask, uint16_t value);
uint16_t RL78G13_Timer_TOM_ReadAll(void);
uint16_t RL78G13_Timer_TOM_ReadOne(uint16_t mask);

void RL78G13_Timer_NFEN1_Write_All(uint8_t channel0NoiseFilterEnable,
    uint8_t channel1NoiseFilterEnable, uint8_t channel2NoiseFilterEnable,
    uint8_t channel3NoiseFilterEnable, uint8_t channel4NoiseFilterEnable,
    uint8_t channel5NoiseFilterEnable, uint8_t channel6NoiseFilterEnable,
    uint8_t channel7NoiseFilterEnable);
void RL78G13_Timer_NFEN1_Write_One(uint8_t mask, uint8_t value);
uint8_t RL78G13_Timer_NFEN1_ReadAll(void);
uint8_t RL78G13_Timer_NFEN1_ReadOne(uint8_t mask);



#endif




